<?php
/**
 * Created by PhpStorm.
 * User: SPARK
 * Date: 09.10.2017
 * Time: 19:42
 */
/**
 * Задача необходимо посчитать сумму по диагонали слева на право в многомерном массиве
 *      1 2 3
 *      4 5 6
 *      7 8 9
 */
$arr = [
    [1,2,3],
    [4,5,6],
    [7,8,9],
];
$sum = $arr[0][2] + $arr[1][1] + $arr[2][0];

$arr2 = [
    [1,2,3,5],
    [4,5,6,8],
    [7,8,9,16],
    [7,8,9,16],
];
$arr3 = [
    [1,2,3,5,11],
    [4,5,6,8,12],
    [7,8,9,16,1],
    [7,8,9,16,0],
    [7,8,9,16,0],
];

$sum1 = $arr[0][0] + $arr[1][1] + $arr[2][2];
//$sum2 = $arr[0][0] + $arr[1][1] + $arr[2][2] + $arr[3][3];
//$sum2 = $arr[0][0] + $arr[1][1] + $arr[2][2] + $arr[3][3] + $arr[4][4];

//echo $sum;
$sum1 = 0;
for ($i=0;$i<=count($arr)-1;$i++){
    $sum1+=$arr[$i][$i];
}
echo $sum1;

$rsum = 0;
for ($i=0;$i<=count($arr);$i++){
    $rsum+=$arr[$i][count($arr)-$i];
}
